# Hotel Booking Analysis (Pandas, 119K rows)

Analyzed 119,390 hotel bookings from two hotels (2015–2017) to understand stay patterns, prices, and guest behavior using Pandas.
Key focus: data cleaning, core KPIs (ADR, nights, total cost), guest geography, repeat guests, and arrival patterns.

In [2]:
import pandas as pd

TASK: Run the following code to read in the "hotel_bookings.csv" file. Feel free to explore the file a bit before continuing with the rest of the exercise.

In [3]:
df=pd.read_csv(r"C:\Users\Krishna\data projects\hotel_booking_folder\hotel_booking.csv")
df.head()

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date,name,email,phone-number,credit_card
0,Resort Hotel,0,342,2015,July,27,1,0,0,2,...,Transient,0.0,0,0,Check-Out,2015-07-01,Ernest Barnes,Ernest.Barnes31@outlook.com,669-792-1661,************4322
1,Resort Hotel,0,737,2015,July,27,1,0,0,2,...,Transient,0.0,0,0,Check-Out,2015-07-01,Andrea Baker,Andrea_Baker94@aol.com,858-637-6955,************9157
2,Resort Hotel,0,7,2015,July,27,1,0,1,1,...,Transient,75.0,0,0,Check-Out,2015-07-02,Rebecca Parker,Rebecca_Parker@comcast.net,652-885-2745,************3734
3,Resort Hotel,0,13,2015,July,27,1,0,1,1,...,Transient,75.0,0,0,Check-Out,2015-07-02,Laura Murray,Laura_M@gmail.com,364-656-8427,************5677
4,Resort Hotel,0,14,2015,July,27,1,0,2,2,...,Transient,98.0,0,1,Check-Out,2015-07-03,Linda Hines,LHines@verizon.com,713-226-5883,************5498

In [66]:
#TASK: How many rows are there?

In [67]:
print(df.shape)
print(df.shape[0])
print(df.shape[1])
print(len(df.index))

(119390, 36)
119390
36
119390

In [68]:
len(df)

119390

In [69]:
#TASK: Is there any missing data? If so, which column has the most missing data?

In [70]:
df.isnull().sum().idxmax()  
# here sum is calculating nan for each column and add them (idxmax is finding that index means column name)

'company'

In [71]:
#TASK: Drop the "company" column from the dataset.

In [72]:
df.drop('company',axis=1)

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date,name,email,phone-number,credit_card
0,Resort Hotel,0,342,2015,July,27,1,0,0,2,...,Transient,0.00,0,0,Check-Out,2015-07-01,Ernest Barnes,Ernest.Barnes31@outlook.com,669-792-1661,************4322
1,Resort Hotel,0,737,2015,July,27,1,0,0,2,...,Transient,0.00,0,0,Check-Out,2015-07-01,Andrea Baker,Andrea_Baker94@aol.com,858-637-6955,************9157
2,Resort Hotel,0,7,2015,July,27,1,0,1,1,...,Transient,75.00,0,0,Check-Out,2015-07-02,Rebecca Parker,Rebecca_Parker@comcast.net,652-885-2745,************3734
3,Resort Hotel,0,13,2015,July,27,1,0,1,1,...,Transient,75.00,0,0,Check-Out,2015-07-02,Laura Murray,Laura_M@gmail.com,364-656-8427,************5677
4,Resort Hotel,0,14,2015,July,27,1,0,2,2,...,Transient,98.00,0,1,Check-Out,2015-07-03,Linda Hines,LHines@verizon.com,713-226-5883,************5498
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
119385,City Hotel,0,23,2017,August,35,30,2,5,2,...,Transient,96.14,0,0,Check-Out,2017-09-06,Claudia Johnson,Claudia.J@yahoo.com,403-092-5582,************8647
119386,City Hotel,0,102,2017,August,35,31,2,5,3,...,Transient,225.43,0,2,Check-Out,2017-09-07,Wesley Aguilar,WAguilar@xfinity.com,238-763-0612,************4333
119387,City Hotel,0,34,2017,August,35,31,2,5,2,...,Transient,157.71,0,4,Check-Out,2017-09-07,Mary Morales,Mary_Morales@hotmail.com,395-518-4100,************1821
119388,City Hotel,0,109,2017,August,35,31,2,5,2,...,Transient,104.40,0,0,Check-Out,2017-09-07,Caroline Conley MD,MD_Caroline@comcast.net,531-528-1017,************7860
119389,City Hotel,0,205,2017,August,35,29,2,7,2,...,Transient,151.20,0,2,Check-Out,2017-09-07,Ariana Michael,Ariana_M@xfinity.com,422-804-6403,************4482

In [73]:
#TASK: What are the top 5 most common country codes in the dataset?

In [74]:
df.columns

Index(['hotel', 'is_canceled', 'lead_time', 'arrival_date_year',
       'arrival_date_month', 'arrival_date_week_number',
       'arrival_date_day_of_month', 'stays_in_weekend_nights',
       'stays_in_week_nights', 'adults', 'children', 'babies', 'meal',
       'country', 'market_segment', 'distribution_channel',
       'is_repeated_guest', 'previous_cancellations',
       'previous_bookings_not_canceled', 'reserved_room_type',
       'assigned_room_type', 'booking_changes', 'deposit_type', 'agent',
       'company', 'days_in_waiting_list', 'customer_type', 'adr',
       'required_car_parking_spaces', 'total_of_special_requests',
       'reservation_status', 'reservation_status_date', 'name', 'email',
       'phone-number', 'credit_card'],
      dtype='object')

In [75]:
df['country'].value_counts().head()  #already nan hat jayega for calculations remember

country
PRT    48590
GBR    12129
FRA    10415
ESP     8568
DEU     7287
Name: count, dtype: int64

In [76]:
df['country'].value_counts()[:5]

country
PRT    48590
GBR    12129
FRA    10415
ESP     8568
DEU     7287
Name: count, dtype: int64

In [77]:
#TASK: What is the name of the person who paid the highest ADR (average daily rate)? How much was their ADR?

In [97]:
x=df[['adr','name']]

In [98]:
print(x)

           adr                name
0         0.00       Ernest Barnes
1         0.00        Andrea Baker
2        75.00      Rebecca Parker
3        75.00        Laura Murray
4        98.00         Linda Hines
...        ...                 ...
119385   96.14     Claudia Johnson
119386  225.43      Wesley Aguilar
119387  157.71        Mary Morales
119388  104.40  Caroline Conley MD
119389  151.20      Ariana Michael

[119390 rows x 2 columns]

In [3]:
n=df['adr'].idxmax()

In [6]:
df.loc[n][['adr','name']]

adr            5400.0
name    Daniel Walter
Name: 48515, dtype: object

In [94]:
x=df[['name','adr']]
x.loc[x['adr'].idxmax()]

name    Daniel Walter
adr            5400.0
Name: 48515, dtype: object

In [40]:
#or
x=df[['name','adr']].sort_values(by='adr',ascending=False)
x.iloc[0]

name    Daniel Walter
adr            5400.0
Name: 48515, dtype: object

In [7]:
#or
x=df[['name','adr']].sort_values(by='adr',ascending=False)
x.head(1)

                name     adr
48515  Daniel Walter  5400.0

In [63]:
#TASK: The adr is the average daily rate for a person's stay at the hotel.
#      What is the mean adr across all the hotel stays in the dataset?

In [53]:
#mean automatic ignores nan if there is any
#or we can drop nan and den calculate mean
round(df['adr'].mean(),2)

101.83

In [54]:
df['adr'].dropna().mean()

101.83112153446686

In [52]:
#TASK: What is the average (mean) number of nights for a stay across the entire data set? 
#      Feel free to round this to 2 decimal points.

In [23]:
df[['stays_in_weekend_nights','stays_in_week_nights']].isnull().sum().sum()

np.int64(0)

In [28]:
df2 = df[['stays_in_weekend_nights','stays_in_week_nights']].dropna()    #this is most imp
df2['total'] = df2['stays_in_weekend_nights'] + df2['stays_in_week_nights']
df2['total'].mean()

np.float64(3.4279001591423066)

In [29]:
#TASK: What is the average total cost for a stay in the dataset?
#      Not average daily cost, but total stay cost.
#      (You will need to calculate total cost your self by using ADR and week day and weeknight stays).
#      Feel free to round this to 2 decimal points.

In [57]:
df.columns

Index(['hotel', 'is_canceled', 'lead_time', 'arrival_date_year',
       'arrival_date_month', 'arrival_date_week_number',
       'arrival_date_day_of_month', 'stays_in_weekend_nights',
       'stays_in_week_nights', 'adults', 'children', 'babies', 'meal',
       'country', 'market_segment', 'distribution_channel',
       'is_repeated_guest', 'previous_cancellations',
       'previous_bookings_not_canceled', 'reserved_room_type',
       'assigned_room_type', 'booking_changes', 'deposit_type', 'agent',
       'company', 'days_in_waiting_list', 'customer_type', 'adr',
       'required_car_parking_spaces', 'total_of_special_requests',
       'reservation_status', 'reservation_status_date', 'name', 'email',
       'phone-number', 'credit_card', 'country_code', 'total_nights'],
      dtype='object')

In [58]:
# Step 1: Calculate the total cost for each stay
df['total_cost'] = df['adr'] * (df['stays_in_weekend_nights'] + df['stays_in_week_nights'])

# Step 2: Calculate the mean of the total cost
mean_total_cost = df['total_cost'].mean()

# Step 3: Round the result to 2 decimal points
mean_total_cost_rounded = round(mean_total_cost, 2)

# Step 4: Display the result
print(f"The average total cost for a stay is ${mean_total_cost_rounded}.")

The average total cost for a stay is $357.85.

In [59]:
round((df['total_nights']*df['adr']).mean(),2)

357.85

In [12]:
#Key Business Insights

In [16]:
df['is_canceled']

0         0
1         0
2         0
3         0
4         0
         ..
119385    0
119386    0
119387    0
119388    0
119389    0
Name: is_canceled, Length: 75166, dtype: int64

In [17]:
mean_adr = round(df["adr"].mean(), 2)
mean_nights = round((df["stays_in_weekend_nights"] + df["stays_in_week_nights"]).mean(), 2)
print(mean_adr, mean_nights)

99.99 3.39

## Key Business Insights

- Average daily rate is about 100, with an average stay of around 3.4 nights, giving an average revenue per stay of about 340  
- Most guests come from a few main countries (PRT, GBR, FRA, ESP, DEU), which shows a strong dependency on specific markets  
- Only about 3% of bookings are repeat guests, suggesting a large share of one-time customers

In [84]:
#TASK: What are the names and emails of people who made exactly 5 "Special Requests"?

In [32]:
x=df[df['total_of_special_requests']==5]
print(x.head(1))
x[['total_of_special_requests','name','email']]

             hotel  is_canceled  lead_time  arrival_date_year  \
7860  Resort Hotel            1         39               2016

     arrival_date_month  arrival_date_week_number  arrival_date_day_of_month  \
7860             August                        36                         30

      stays_in_weekend_nights  stays_in_week_nights  adults  ...    adr  \
7860                        0                     5       2  ...  159.0

      required_car_parking_spaces total_of_special_requests  \
7860                            0                         5

     reservation_status reservation_status_date           name  \
7860           Canceled              2016-07-22  Amanda Harper

                     email  phone-number       credit_card t_night
7860  Amanda.H66@yahoo.com  864-257-9807  ************9835       5

[1 rows x 37 columns]

,total_of_special_requests,name,email
7860,5,Amanda Harper,Amanda.H66@yahoo.com
11125,5,Laura Sanders,Sanders_Laura@hotmail.com
14596,5,Tommy Ortiz,Tommy_O@hotmail.com
14921,5,Gilbert Miller,Miller.Gilbert@aol.com
14922,5,Timothy Torres,TTorres@protonmail.com
24630,5,Jennifer Weaver,Jennifer_W@aol.com
27288,5,Crystal Horton,Crystal.H@mail.com
27477,5,Brittney Burke,Burke_Brittney16@att.com
29906,5,Cynthia Cabrera,Cabrera.Cynthia@xfinity.com
29949,5,Sarah Floyd,Sarah_F@gmail.com
32267,5,Michelle Villa,Michelle.Villa@aol.com
39027,5,Nichole Hebert,Hebert.Nichole@gmail.com
39129,5,Lindsey Mckenzie,Lindsey.Mckenzie@att.com
39525,5,Ashley Edwards,Edwards.Ashley@yahoo.com
70114,5,Christopher Torres,Torres.Christopher@gmail.com
78819,5,Mrs. Tara Sullivan DVM,Mrs..DVM@xfinity.com
78820,5,Michaela Brown,MichaelaBrown@att.com
78822,5,Kurt Maldonado MD,KMD15@xfinity.com
97072,5,Jason Richardson,Jason.R@zoho.com
97099,5,Terri Hurley,THurley@xfinity.com
97261,5,Mrs. Caitlin Webb,Mrs._W@comcast.net
98410,5,Holly Arroyo,Arroyo_Holly@mail.com
98674,5,Denise Campbell,Denise_C@gmail.com
99887,5,Michael Smith,Michael.S42@aol.com
99888,5,Dr. Trevor Sellers,Dr._S@aol.com
101569,5,Kayla Murphy,Kayla.Murphy@yahoo.com
102061,5,Taylor Martinez,Taylor.Martinez@hotmail.com
109511,5,Charles Wilson,Charles_Wilson@yahoo.com
109590,5,Tyler Allison,Tyler.A@protonmail.com
110082,5,Matthew Bailey,Matthew_Bailey@aol.com
110083,5,Charlotte Acevedo,Charlotte_A@verizon.com
111909,5,Darrell Brennan,Brennan_Darrell51@hotmail.com
111911,5,Melinda Jensen,MelindaJensen@zoho.com
113915,5,Terry Arnold,Arnold.Terry@zoho.com
114770,5,Mary Nguyen,Nguyen.Mary@protonmail.com
114909,5,Lindsay Cuevas,Lindsay.Cuevas40@mail.com
116455,5,Cynthia Hernandez,CynthiaHernandez@xfinity.com
116457,5,Angela Hawkins,Angela_H@gmail.com
118817,5,Sue Lawson,Sue.L52@comcast.net
119161,5,Alyssa Richards,Alyssa_Richards@aol.com

In [94]:
#TASK: What percentage of hotel stays were classified as "repeat guests"?
#     (Do not base this off the name of the person, but instead of the is_repeated_guest column)

In [36]:
len(df)

119390

In [37]:
df['is_repeated_guest']==1

0         False
1         False
2         False
3         False
4         False
          ...
119385    False
119386    False
119387    False
119388    False
119389    False
Name: is_repeated_guest, Length: 119390, dtype: bool

In [38]:
round((sum(df['is_repeated_guest']==1)/len(df))*100,2)

3.19

In [103]:
#TASK: What are the top 5 most common last name in the dataset?
#     Bonus: Can you figure this out in one line of pandas code? 
#(For simplicity treat the title such as MD as a last name,
#for example Caroline Conley MD can be said to have the last name MD)

In [45]:
df['name'].str.split().str[-1].value_counts().head()

name
Smith       2503
Johnson     1990
Williams    1618
Jones       1434
Brown       1423
Name: count, dtype: int64

In [46]:
#OR

df['name'].apply(lambda name : name.split()[-1]).value_counts().head()

name
Smith       2503
Johnson     1990
Williams    1618
Jones       1434
Brown       1423
Name: count, dtype: int64

In [128]:
#TASK: What are the names of the people who had booked the most number children and babies for their stay?
#     (Don't worry if they canceled, only consider number of people reported at the time of their reservation)

In [49]:
df[['children','babies']].dropna()

        children  babies
0            0.0       0
1            0.0       0
2            0.0       0
3            0.0       0
4            0.0       0
...          ...     ...
119385       0.0       0
119386       0.0       0
119387       0.0       0
119388       0.0       0
119389       0.0       0

[119386 rows x 2 columns]

In [50]:
df['total_kids']=df['children']+df['babies']
df.sort_values('total_kids',ascending=False)[['name','total_kids']]

                   name  total_kids
328       Jamie Ramirez        10.0
46619   Nicholas Parker        10.0
78656     Marc Robinson         9.0
6681     Nicolas Thomas         3.0
16360       Ashley Cole         3.0
...                 ...         ...
119389   Ariana Michael         0.0
40600      Craig Campos         NaN
40667      David Murphy         NaN
40679      Frank Burton         NaN
41160     Jerry Roberts         NaN

[119390 rows x 2 columns]

In [51]:
#TASK: What are the top 3 most common area code in the phone numbers? (Area code is first 3 digits)

In [52]:
df['phone-number'].str[:3].value_counts().head(3)

phone-number
799    168
185    167
541    166
Name: count, dtype: int64

In [53]:
#or

df['phone-number'].apply(lambda x:x[:3]).value_counts().head(3)

phone-number
799    168
185    167
541    166
Name: count, dtype: int64

In [54]:
#TASK: How many arrivals took place between the 1st and the 15th of the month
#     (inclusive of 1 and 15) ? Bonus: Can you do this in one line of pandas code?

In [55]:
df['arrival_date_day_of_month'].head()

0    1
1    1
2    1
3    1
4    1
Name: arrival_date_day_of_month, dtype: int64

In [151]:
df['arrival_date_day_of_month'].apply(lambda x:x in range(1,16)).sum()

58152

In [152]:
#HARD BONUS TASK: Create a table for counts for each day of the week that people arrived.
#                (E.g. 5000 arrivals were on a Monday, 3000 were on a Tuesday, etc..)

In [4]:
import pandas as pd
df.columns

Index(['hotel', 'is_canceled', 'lead_time', 'arrival_date_year',
       'arrival_date_month', 'arrival_date_week_number',
       'arrival_date_day_of_month', 'stays_in_weekend_nights',
       'stays_in_week_nights', 'adults', 'children', 'babies', 'meal',
       'country', 'market_segment', 'distribution_channel',
       'is_repeated_guest', 'previous_cancellations',
       'previous_bookings_not_canceled', 'reserved_room_type',
       'assigned_room_type', 'booking_changes', 'deposit_type', 'agent',
       'company', 'days_in_waiting_list', 'customer_type', 'adr',
       'required_car_parking_spaces', 'total_of_special_requests',
       'reservation_status', 'reservation_status_date', 'name', 'email',
       'phone-number', 'credit_card'],
      dtype='object')

In [5]:
df[['arrival_date_day_of_month','arrival_date_month','arrival_date_year']].dropna()

        arrival_date_day_of_month arrival_date_month  arrival_date_year
0                               1               July               2015
1                               1               July               2015
2                               1               July               2015
3                               1               July               2015
4                               1               July               2015
...                           ...                ...                ...
119385                         30             August               2017
119386                         31             August               2017
119387                         31             August               2017
119388                         31             August               2017
119389                         29             August               2017

[119390 rows x 3 columns]

In [6]:
df['arrival_date']=df['arrival_date_day_of_month'].astype(str)+'-'+df['arrival_date_month'].astype(str)+'-'+df['arrival_date_year'].astype(str)

In [7]:
df['arrival_date'].head()

0    1-July-2015
1    1-July-2015
2    1-July-2015
3    1-July-2015
4    1-July-2015
Name: arrival_date, dtype: object

In [8]:
df['arrival_date']=pd.to_datetime(df['arrival_date'])

In [9]:
df['arrival_date'].dtype

dtype('<M8[ns]')

In [10]:
df['day_name']=df['arrival_date'].dt.day_name()
df = df[df['is_canceled'] == 0]

In [11]:
df['day_name'].value_counts()

day_name
Monday       11976
Friday       11653
Thursday     11327
Saturday     10926
Wednesday    10308
Sunday        9577
Tuesday       9399
Name: count, dtype: int64

## Project Summary

"Analyzed 119K hotel bookings with Pandas to clean the data, calculate core revenue and stay metrics, and understand guest and arrival patterns as a foundation for future prediction models."